---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ArcWallCntrMrkVisible
source: html/472ac317-2f00-43ba-30e8-6c2c06e7ea91.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ArcWallCntrMrkVisible Property

"Center Mark Visible"

## Syntax (C#)
```csharp
public static ForgeTypeId ArcWallCntrMrkVisible { get; }
```